[{"hadith_narrator":"It was narrated that Jabir said:","arabic_sanad":"حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏","hadith":{"en":"“The Messenger of Allah (ﷺ) said: 'Whoever has a date-palm tree or land, should not sell it until he has offered it to his partner.' ”","ar":"\"‏ مَنْ كَانَتْ لَهُ نَخْلٌ أَوْ أَرْضٌ فَلاَ يَبِيعُهَا حَتَّى يَعْرِضَهَا عَلَى شَرِيكِهِ ‏\""},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2492"},{"Arabic reference":"Book 17, Hadith 2587"}]},{"hadith_narrator":"It was narrated from Ibn Abbas that the Prophet (ﷺ) said:","arabic_sanad":"حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، وَالْعَلاَءُ بْنُ سَالِمٍ، قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا شَرِيكٌ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏","hadith":{"en":"“Whoever has land and wants to sell it, let him offer it to his neighbor.”","ar":"\"‏ مَنْ كَانَتْ لَهُ أَرْضٌ فَأَرَادَ بَيْعَهَا فَلْيَعْرِضْهَا عَلَى جَارِهِ ‏\""},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2493"},{"Arabic reference":"Book 17, Hadith 2588"}]},{"hadith_narrator":"It was narrated from Jabir that the Messenger of Allah (ﷺ) said:","arabic_sanad":"حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، أَنْبَأَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏","hadith":{"en":"“The neighbor has more right to preemption of his neighbor, so let him wait for him even if he is absent, if they share a path.”","ar":"\"‏ الْجَارُ أَحَقُّ بِشُفْعَةِ جَارِهِ يَنْتَظِرُ بِهَا إِنْ كَانَ غَائِبًا إِذَا كَانَ طَرِيقُهُمَا وَاحِدًا ‏\""},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2494"},{"Arabic reference":"Book 17, Hadith 2589"}]},{"hadith_narrator":"It was narrated from Abu Rafi' that the Prophet (ﷺ) said:","arabic_sanad":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِي رَافِعٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏","hadith":{"en":"“The neighbor has more right to property that is near.”","ar":"\"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\""},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2495"},{"Arabic reference":"Book 17, Hadith 2590"}]},{"hadith_narrator":"It was narrated that Sharid bin Suwaid said:","arabic_sanad":"حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ عَمْرِو بْنِ الشَّرِيدِ بْنِ سُوَيْدٍ، عَنْ أَبِيهِ الشَّرِيدِ بْنِ سُوَيْدٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَرْضٌ لَيْسَ فِيهَا لأَحَدٍ قِسْمٌ وَلاَ شِرْكٌ إِلاَّ الْجِوَارُ ‏.‏ قَالَ ‏","hadith":{"en":"“I said:\n'O Messenger of Allah, (what do you think of) land owned by only one person but this land has neighbors?' He said: 'The neighbor has more right to property that is near.' ”","ar":"\"‏ الْجَارُ أَحَقُّ بِسَقَبِهِ ‏\""},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2496"},{"Arabic reference":"Book 17, Hadith 2591"}]},{"hadith_narrator":"It was narrated from Abu Hurairah that:","arabic_sanad":"","hadith":{"en":"the Messenger of Allah (ﷺ) ruled concerning preemption of land that has not been divided; if the boundaries have been set then there is no preemption.","ar":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، وَعَبْدُ الرَّحْمَنِ بْنُ عُمَرَ، قَالاَ حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أَبِي هُرَيْرَةَ ـ رضي الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَضَى بِالشُّفْعَةِ فِيمَا لَمْ يُقْسَمْ فَإِذَا وَقَعَتِ الْحُدُودُ فَلاَ شُفْعَةَ ‏.‏"},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2497"},{"Arabic reference":"Book 17, Hadith 2592"}]},{"hadith_narrator":null,"arabic_sanad":"","hadith":{"en":"","ar":"حَدَّثَنَا مُحَمَّدُ بْنُ حَمَّادٍ الطِّهْرَانِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، وَأَبِي، سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ‏.‏ قَالَ أَبُو عَاصِمٍ سَعِيدُ بْنُ الْمُسَيَّبِ مُرْسَلٌ وَأَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ مُتَّصِلٌ ‏.‏"},"reference":[{"Arabic reference":"Book 17, Hadith 2593"}]},{"hadith_narrator":"It was narrated from Abu Rafi' that the Messenger of Allah (ﷺ) said:","arabic_sanad":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْجَرَّاحِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِي رَافِعٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏","hadith":{"en":"“The partner has more right to what is near him, so long as he is still a partner.”","ar":"\"‏ الشَّرِيكُ أَحَقُّ بِسَقَبِهِ مَا كَانَ ‏\""},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2498"},{"Arabic reference":"Book 17, Hadith 2594"}]},{"hadith_narrator":"It was narrated from Jabir bin Abdullah that:","arabic_sanad":"","hadith":{"en":"the Messenger of Allah (ﷺ) ruled that preemption takes effect in all cases where land has not been divided. But if the boundaries have been set and the roads laid out, then there is no preemption.”","ar":"حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ إِنَّمَا جَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم الشُّفْعَةَ فِي كُلِّ مَا لَمْ يُقْسَمْ فَإِذَا وَقَعَتِ الْحُدُودُ وَصُرِّفَتِ الطُّرُقُ فَلاَ شُفْعَةَ ‏\"‏ ‏.‏"},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2499"},{"Arabic reference":"Book 17, Hadith 2595"}]},{"hadith_narrator":"It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:","arabic_sanad":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏","hadith":{"en":"“Preemption is like undoing the `Iqal.”","ar":"\"‏ الشُّفْعَةُ كَحَلِّ الْعِقَالِ ‏\""},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2500"},{"Arabic reference":"Book 17, Hadith 2596"}]},{"hadith_narrator":"It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:","arabic_sanad":"حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ الْحَارِثِ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْبَيْلَمَانِيِّ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏","hadith":{"en":"“There is no preemption for a partner when his co-partner has beaten him to it (in another deal before), not for a minor nor one who is absent.”","ar":"\"‏ لاَ شُفْعَةَ لِشَرِيكٍ عَلَى شَرِيكٍ إِذَا سَبَقَهُ بِالشِّرَاءِ وَلاَ لِصَغِيرٍ وَلاَ لِغَائِبٍ ‏\""},"reference":[{"English reference":"Vol. 3, Book 17, Hadith 2501"},{"Arabic reference":"Book 17, Hadith 2597"}]}]