[{"hadith_narrator":"Narrated Anas:","arabic_sanad":"حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ ـ رضى الله عنه ـ قَالَ وَلَقَدْ رَهَنَ النَّبِيُّ صلى الله عليه وسلم دِرْعَهُ بِشَعِيرٍ، وَمَشَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم بِخُبْزِ شَعِيرٍ وَإِهَالَةٍ سَنِخَةٍ، وَلَقَدْ سَمِعْتُهُ يَقُولُ ‏","hadith":{"en":"No doubt, the Prophet (ﷺ) mortgaged his armor for barley grams. Once I took barley bread with some \ndissolved fat on it to the Prophet (ﷺ) and I heard him saying, \"The household of Muhammad did not \npossess except a Sa (of food grain, barley, etc.) for both the morning and the evening meals although \nthey were nine houses.\"","ar":"\"‏ مَا أَصْبَحَ لآلِ مُحَمَّدٍ صلى الله عليه وسلم إِلاَّ صَاعٌ، وَلاَ أَمْسَى ‏\""},"reference":[{"Reference":" Sahih al-Bukhari 2508"},{"In-book reference":" Book 48, Hadith 1"},{"USC-MSA web (English) reference":"Vol. 3, Book 45, Hadith 685"},{"  (deprecated numbering scheme)":null}]},{"hadith_narrator":"Narrated `Aisha:","arabic_sanad":"","hadith":{"en":"The Prophet (ﷺ) bought some foodstuff on credit for a limited period and mortgaged his armor for it.","ar":"حَدَّثَنَا مُسَدَّدٌ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الأَعْمَشُ، قَالَ تَذَاكَرْنَا عِنْدَ إِبْرَاهِيمَ الرَّهْنَ، وَالْقَبِيلَ فِي السَّلَفِ، فَقَالَ إِبْرَاهِيمُ حَدَّثَنَا الأَسْوَدُ عَنْ عَائِشَةَ ـ رضى الله عنها ـ أَنَّ النَّبِيَّ صلى الله عليه وسلم اشْتَرَى مِنْ يَهُودِيٍّ طَعَامًا إِلَى أَجَلٍ وَرَهَنَهُ دِرْعَهُ‏.‏"},"reference":[{"Reference":" Sahih al-Bukhari 2509"},{"In-book reference":" Book 48, Hadith 2"},{"USC-MSA web (English) reference":"Vol. 3, Book 45, Hadith 686"},{"  (deprecated numbering scheme)":null}]},{"hadith_narrator":"Narrated Jabir bin `Abdullah:","arabic_sanad":"حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا سُفْيَانُ، قَالَ عَمْرٌو سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ ـ رضى الله عنهما ـ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏","hadith":{"en":"Allah's Messenger (ﷺ) said, \"Who would kill Ka`b bin Al-Ashraf as he has harmed Allah and His Apostle ?\" \nMuhammad bin Maslama (got up and) said, \"I will kill him.\" So, Muhammad bin Maslama went to \nKa`b and said, \"I want a loan of one or two Wasqs of food grains.\" Ka`b said, \"Mortgage your women \nto me.\" Muhammad bin Maslama said, \"How can we mortgage our women, and you are the most \nhandsome among the Arabs?\" He said, \"Then mortgage your sons to me.\" Muhammad said, \"How can \nwe mortgage our sons, as the people will abuse them for being mortgaged for one or two Wasqs of \nfood grains? It is shameful for us. But we will mortgage our arms to you.\" So, Muhammad bin \nMaslama promised him that he would come to him next time. They (Muhammad bin Maslama and his \ncompanions came to him as promised and murdered him. Then they went to the Prophet (ﷺ) and told him \nabout it.","ar":"\"‏ مَنْ لِكَعْبِ بْنِ الأَشْرَفِ فَإِنَّهُ آذَى اللَّهَ وَرَسُولَهُ صلى الله عليه وسلم ‏\""},"reference":[{"Reference":" Sahih al-Bukhari 2510"},{"In-book reference":" Book 48, Hadith 3"},{"USC-MSA web (English) reference":"Vol. 3, Book 45, Hadith 687"},{"  (deprecated numbering scheme)":null}]},{"hadith_narrator":"Narrated Abu Huraira:","arabic_sanad":"حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ عَامِرٍ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَقُولُ ‏","hadith":{"en":"The Prophet (ﷺ) said, \"One can ride the mortgaged animal because of what one spends on it, and one can \ndrink the milk of a milch animal as long as it is mortgaged. \"","ar":"\"‏ الرَّهْنُ يُرْكَبُ بِنَفَقَتِهِ، وَيُشْرَبُ لَبَنُ الدَّرِّ إِذَا كَانَ مَرْهُونًا ‏\""},"reference":[{"Reference":" Sahih al-Bukhari 2511"},{"In-book reference":" Book 48, Hadith 4"},{"USC-MSA web (English) reference":"Vol. 3, Book 45, Hadith 688"},{"  (deprecated numbering scheme)":null}]},{"hadith_narrator":"Narrated Abu Huraira:","arabic_sanad":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ، أَخْبَرَنَا عَبْدُ اللَّهِ، أَخْبَرَنَا زَكَرِيَّاءُ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم‏.‏ ‏","hadith":{"en":"Allah's Messenger (ﷺ) said, \"The mortgaged animal can be used for riding as long as it is fed and the milk of \nthe milch animal can be drunk according to what one spend on it. The one who rides the animal or \ndrinks its milk should provide the expenditures.\"","ar":"\"‏ الرَّهْنُ يُرْكَبُ بِنَفَقَتِهِ إِذَا كَانَ مَرْهُونًا، وَلَبَنُ الدَّرِّ يُشْرَبُ بِنَفَقَتِهِ إِذَا كَانَ مَرْهُونًا، وَعَلَى الَّذِي يَرْكَبُ وَيَشْرَبُ النَّفَقَةُ ‏\""},"reference":[{"Reference":" Sahih al-Bukhari 2512"},{"In-book reference":" Book 48, Hadith 5"},{"USC-MSA web (English) reference":"Vol. 3, Book 45, Hadith 689"},{"  (deprecated numbering scheme)":null}]},{"hadith_narrator":"Narrated `Aisha:","arabic_sanad":"","hadith":{"en":"Allah's Messenger (ﷺ) bought some foodstuff from a Jew and mortgaged his armor to him.","ar":"حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ ـ رضى الله عنها ـ قَالَتِ اشْتَرَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ يَهُودِيٍّ طَعَامًا وَرَهَنَهُ دِرْعَهُ‏.‏"},"reference":[{"Reference":" Sahih al-Bukhari 2513"},{"In-book reference":" Book 48, Hadith 6"},{"USC-MSA web (English) reference":"Vol. 3, Book 45, Hadith 690"},{"  (deprecated numbering scheme)":null}]},{"hadith_narrator":"Narrated Ibn Abu Mulaika:","arabic_sanad":"","hadith":{"en":"I wrote a letter to Ibn `Abbas and he wrote to me that the Prophet (ﷺ) had given the verdict that the \ndefendant had to take an oath.","ar":"حَدَّثَنَا خَلاَّدُ بْنُ يَحْيَى، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ كَتَبْتُ إِلَى ابْنِ عَبَّاسٍ فَكَتَبَ إِلَىَّ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَضَى أَنَّ الْيَمِينَ عَلَى الْمُدَّعَى عَلَيْهِ‏.‏"},"reference":[{"Reference":" Sahih al-Bukhari 2514"},{"In-book reference":" Book 48, Hadith 7"},{"USC-MSA web (English) reference":"Vol. 3, Book 45, Hadith 691"},{"  (deprecated numbering scheme)":null}]},{"hadith_narrator":"Narrated Abu Wail:","arabic_sanad":"","hadith":{"en":"Abdullah (bin Mas'ud) said, \"Whoever took a false oath in order to grab somebody's property will meet Allah while Allah will be angry with him.\" Allah revealed the following verse to confirm that:--\"Verily! Those who purchase a small gain at the cost of Allah's covenant And their oaths...a painful torment.\" (3.77)   Al-Ash'ath bin Qais came to us and asked as to what Abu Abdur-Rehman (i.e. Ibn Mas'ud) was telling you.\" We related the story to him. On that he said, \"He has told the truth. This verse was revealed about me. I had some dispute with another man regarding a well and we took the case before Allah's Messenger (ﷺ). Allah's Messenger (ﷺ) said (to me), \"Produce two witnesses (to support your claim); otherwise the defendant has the right to take an oath (to refute your claim).' I said, 'The defendant would not mind to take a false oath.\" Allah's Messenger (ﷺ) then said, 'Whoever took a false oath in order to grab someone else's property will meet Allah, Allah will be angry with him.' Allah then revealed what Confirmed it.\" Al-Ash'ath then recited the following Verse:--\"Verily! Those who purchase a small gain at the cost of Allah's covenant, And their oaths . . . (to) . . . they shall have a painful torment!' (3.77) (See Hadith No. 546)","ar":"حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، قَالَ قَالَ عَبْدُ اللَّهِ ـ رضى الله عنه مَنْ حَلَفَ عَلَى يَمِينٍ، يَسْتَحِقُّ بِهَا مَالاً وَهْوَ فِيهَا فَاجِرٌ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ، فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ فَقَرَأَ إِلَى ‏{‏عَذَابٌ أَلِيمٌ‏}‏‏.‏ثُمَّ إِنَّ الأَشْعَثَ بْنَ قَيْسٍ خَرَجَ إِلَيْنَا فَقَالَ مَا يُحَدِّثُكُمْ أَبُو عَبْدِ الرَّحْمَنِ قَالَ فَحَدَّثْنَاهُ قَالَ فَقَالَ صَدَقَ لَفِيَّ وَاللَّهِ أُنْزِلَتْ، كَانَتْ بَيْنِي وَبَيْنَ رَجُلٍ خُصُومَةٌ فِي بِئْرٍ فَاخْتَصَمْنَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ شَاهِدُكَ أَوْ يَمِينُهُ ‏\"‏‏.‏ قُلْتُ إِنَّهُ إِذًا يَحْلِفُ وَلاَ يُبَالِي‏.‏ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ مَنْ حَلَفَ عَلَى يَمِينٍ يَسْتَحِقُّ بِهَا مَالاً هُوَ فِيهَا فَاجِرٌ، لَقِيَ اللَّهَ وَهْوَ عَلَيْهِ غَضْبَانُ ‏\"‏‏.‏ فَأَنْزَلَ اللَّهُ تَصْدِيقَ ذَلِكَ، ثُمَّ اقْتَرَأَ هَذِهِ الآيَةَ ‏{‏إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً‏}‏ إِلَى ‏{‏وَلَهُمْ عَذَابٌ أَلِيمٌ‏}‏‏.‏"},"reference":[{"Reference":" Sahih al-Bukhari 2515"},{"In-book reference":" Book 48, Hadith 8"},{"USC-MSA web (English) reference":"Vol. 3, Book 45, Hadith 692"},{"  (deprecated numbering scheme)":null}]}]